_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 78, 78, 32)        320       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 39, 39, 32)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 37, 37, 64)        18496     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 18, 18, 64)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 18, 18, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 16, 16, 128)       73856     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 6, 6, 256)         295168    
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 3, 3, 256)         0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 3, 3, 256)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 1, 1, 512)         1180160   
_________________________________________________________________
flatten_2 (Flatten)          (None, 512)               0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               65664     
_________________________________________________________________
dropout_10 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 129       
=================================================================
Total params: 1,633,793
Trainable params: 1,633,793
Non-trainable params: 0
_________________________________________________________________
